---
kind: other
id: Properties.T:Autodesk.Revit.DB.Visual.AssetPropertyEnum
source: html/b6c08150-14a7-47fa-717c-34ab291ef503.htm
---
# AssetPropertyEnum Properties

Identifies if the object is read-only or modifiable.
 If true, the object may not be modified. If false, the object's contents may be modified.